performance/mysql8-jemalloc-profiling/logs/jemalloc521.run.oltp_read_only.512.2021-02-12_191538.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 512
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

1,512,12407.43,203629.97,178314.53,0.00,25315.44,153.02,0.00,0.00
2,512,14621.03,233811.68,204593.34,0.00,29218.34,40.37,0.00,0.00
3,512,14432.61,230966.69,202097.48,0.00,28869.21,38.25,0.00,0.00
4,512,14392.05,230105.89,201325.78,0.00,28780.11,38.25,0.00,0.00
5,512,14269.92,228518.81,199975.96,0.00,28542.84,38.94,0.00,0.00
6,512,14478.44,231579.10,202627.21,0.00,28951.89,37.56,0.00,0.00
7,512,14469.19,231505.08,202563.69,0.00,28941.38,37.56,0.00,0.00
8,512,14493.39,232061.35,203071.56,0.00,28989.79,37.56,0.00,0.00
9,512,14514.04,232134.60,203100.52,0.00,29034.07,38.25,0.00,0.00
10,512,14570.11,233038.70,203910.49,0.00,29128.21,38.25,0.00,0.00
11,512,14539.02,232477.30,203398.26,0.00,29079.03,38.25,0.00,0.00
12,512,14503.62,232273.93,203265.69,0.00,29008.24,38.25,0.00,0.00
13,512,14481.86,231783.72,202817.01,0.00,28966.72,38.25,0.00,0.00
14,512,14557.61,232739.74,203632.52,0.00,29107.22,38.25,0.00,0.00
15,512,14480.25,231827.05,202858.55,0.00,28968.51,37.56,0.00,0.00
16,512,14576.81,233124.03,203977.40,0.00,29146.63,38.25,0.00,0.00
17,512,14550.22,232820.49,203712.05,0.00,29108.44,38.25,0.00,0.00
18,512,14539.54,232588.67,203520.59,0.00,29068.09,38.25,0.00,0.00
19,512,14494.84,232134.47,203136.79,0.00,28997.69,38.25,0.00,0.00
20,512,14502.78,231896.43,202889.87,0.00,29006.56,38.25,0.00,0.00
21,512,14521.39,232330.28,203294.50,0.00,29035.78,38.25,0.00,0.00
22,512,14483.78,231789.56,202818.99,0.00,28970.57,38.25,0.00,0.00
23,512,14542.25,232729.00,203645.50,0.00,29083.50,38.25,0.00,0.00
24,512,14530.10,232309.60,203251.41,0.00,29058.20,38.25,0.00,0.00
25,512,14537.29,232816.64,203743.07,0.00,29073.57,38.25,0.00,0.00
26,512,14505.17,231899.68,202879.35,0.00,29020.33,38.25,0.00,0.00
27,512,14545.57,232731.13,203641.99,0.00,29089.14,38.25,0.00,0.00
28,512,14485.62,231876.00,202904.75,0.00,28971.25,38.25,0.00,0.00
29,512,14487.09,231847.39,202872.22,0.00,28975.17,38.25,0.00,0.00
30,512,14534.57,232425.08,203355.95,0.00,29069.13,38.25,0.00,0.00
31,512,14493.51,231876.21,202894.19,0.00,28982.03,38.25,0.00,0.00
32,512,14521.55,232358.80,203314.70,0.00,29044.10,38.25,0.00,0.00
33,512,14511.59,232240.42,203214.25,0.00,29026.18,38.25,0.00,0.00
34,512,14518.24,232356.79,203322.32,0.00,29034.48,37.56,0.00,0.00
35,512,14635.99,234063.79,204791.81,0.00,29271.97,38.25,0.00,0.00
36,512,14548.43,232745.91,203654.05,0.00,29091.86,38.25,0.00,0.00
37,512,14489.53,231885.45,202902.39,0.00,28983.06,38.25,0.00,0.00
38,512,14521.04,232296.68,203249.60,0.00,29047.08,38.25,0.00,0.00
39,512,14508.77,231993.31,202983.77,0.00,29009.54,38.25,0.00,0.00
40,512,14525.91,232576.65,203517.82,0.00,29058.83,38.25,0.00,0.00
41,512,14551.37,232751.95,203653.21,0.00,29098.74,38.25,0.00,0.00
42,512,14559.69,233109.03,203990.65,0.00,29118.38,38.25,0.00,0.00
43,512,14499.98,232022.72,203018.76,0.00,29003.97,38.25,0.00,0.00
44,512,14566.40,233063.32,203936.53,0.00,29126.79,38.25,0.00,0.00
45,512,14580.31,233176.97,204010.35,0.00,29166.62,37.56,0.00,0.00
46,512,14584.69,233338.96,204168.59,0.00,29170.37,38.25,0.00,0.00
47,512,15639.94,250235.09,218958.21,0.00,31276.89,112.67,0.00,0.00
48,512,14536.93,232597.93,203524.06,0.00,29073.87,38.94,0.00,0.00
49,512,14495.98,232137.65,203139.69,0.00,28997.95,38.94,0.00,0.00
50,512,14545.78,232635.46,203551.90,0.00,29083.56,38.94,0.00,0.00
51,512,14550.75,232751.94,203650.45,0.00,29101.49,38.25,0.00,0.00
52,512,14556.97,232938.44,203821.51,0.00,29116.93,38.25,0.00,0.00
53,512,14513.54,232222.66,203192.58,0.00,29030.08,38.25,0.00,0.00
54,512,14563.15,232956.39,203834.09,0.00,29122.30,38.25,0.00,0.00
55,512,14535.67,232624.78,203555.43,0.00,29069.35,38.25,0.00,0.00
56,512,14536.29,232543.59,203468.02,0.00,29075.57,38.25,0.00,0.00
57,512,14615.29,233741.59,204512.02,0.00,29229.57,38.25,0.00,0.00
58,512,14499.01,232084.23,203090.20,0.00,28994.03,38.25,0.00,0.00
59,512,15187.35,242850.60,212469.90,0.00,30380.70,51.94,0.00,0.00
60,512,14572.19,233362.02,204214.65,0.00,29147.38,38.94,0.00,0.00
61,512,14549.53,232711.51,203615.45,0.00,29096.06,38.25,0.00,0.00
62,512,14591.66,233579.63,204393.30,0.00,29186.33,37.56,0.00,0.00
63,512,14516.73,232204.65,203177.19,0.00,29027.46,37.56,0.00,0.00
64,512,14553.56,232649.92,203546.81,0.00,29103.11,38.25,0.00,0.00
65,512,14517.95,232471.13,203426.23,0.00,29044.89,38.25,0.00,0.00
66,512,14573.55,233207.84,204059.73,0.00,29148.10,38.25,0.00,0.00
67,512,14765.35,235735.62,206210.91,0.00,29524.70,38.25,0.00,0.00
68,512,14808.97,237495.57,207873.62,0.00,29621.95,38.94,0.00,0.00
69,512,14523.64,232328.19,203281.92,0.00,29046.27,38.25,0.00,0.00
70,512,14550.20,232759.23,203660.82,0.00,29098.40,38.25,0.00,0.00
71,512,15502.85,248110.56,217104.86,0.00,31005.70,106.75,0.00,0.00
72,512,14544.81,232709.01,203616.38,0.00,29092.63,38.94,0.00,0.00
73,512,14541.11,232593.78,203511.55,0.00,29082.22,38.25,0.00,0.00
74,512,14513.12,232280.91,203256.67,0.00,29024.24,37.56,0.00,0.00
75,512,14951.26,239359.26,209461.74,0.00,29897.53,47.47,0.00,0.00
76,512,14593.36,233266.78,204076.06,0.00,29190.72,40.37,0.00,0.00
77,512,14515.56,232328.89,203296.78,0.00,29032.11,38.94,0.00,0.00
78,512,14574.13,233144.12,203996.85,0.00,29147.26,38.25,0.00,0.00
79,512,14522.67,232396.77,203348.43,0.00,29048.35,38.25,0.00,0.00
80,512,14500.28,231987.42,202982.87,0.00,29004.55,38.25,0.00,0.00
81,512,14510.73,232212.68,203203.22,0.00,29009.46,38.25,0.00,0.00
82,512,14555.16,232737.50,203624.19,0.00,29113.31,38.25,0.00,0.00
83,512,14599.33,233736.31,204536.65,0.00,29199.66,38.25,0.00,0.00
84,512,14549.18,232809.96,203706.59,0.00,29103.37,38.25,0.00,0.00
85,512,14519.39,232207.19,203170.41,0.00,29036.77,38.25,0.00,0.00
86,512,14580.96,233298.34,204137.42,0.00,29160.92,38.25,0.00,0.00
87,512,15130.82,241978.07,211714.43,0.00,30263.64,39.65,0.00,0.00
88,512,14565.33,233283.28,204155.62,0.00,29127.67,38.25,0.00,0.00
89,512,14518.43,232188.92,203152.05,0.00,29036.87,37.56,0.00,0.00
90,512,14508.37,232160.89,203145.15,0.00,29015.74,37.56,0.00,0.00
91,512,14532.70,232607.28,203536.87,0.00,29070.41,37.56,0.00,0.00
92,512,14572.17,232962.70,203831.36,0.00,29131.34,37.56,0.00,0.00
93,512,14605.33,233976.22,204749.57,0.00,29226.65,38.25,0.00,0.00
94,512,14525.15,232190.33,203154.04,0.00,29036.29,37.56,0.00,0.00
95,512,14585.78,233458.45,204281.89,0.00,29176.56,37.56,0.00,0.00
96,512,14520.51,232200.12,203157.11,0.00,29043.01,37.56,0.00,0.00
97,512,14527.72,232562.63,203503.18,0.00,29059.45,37.56,0.00,0.00
98,512,14561.79,232878.67,203757.09,0.00,29121.58,37.56,0.00,0.00
99,512,14518.04,232385.70,203348.61,0.00,29037.09,37.56,0.00,0.00
100,512,14533.34,232428.48,203362.79,0.00,29065.68,37.56,0.00,0.00
101,512,14496.79,232040.71,203048.12,0.00,28992.59,37.56,0.00,0.00
102,512,14557.87,232918.93,203805.18,0.00,29113.74,37.56,0.00,0.00
103,512,14509.74,232151.79,203128.31,0.00,29023.47,37.56,0.00,0.00
104,512,14622.71,233902.43,204659.00,0.00,29243.43,37.56,0.00,0.00
105,512,14496.46,232123.41,203131.48,0.00,28991.92,37.56,0.00,0.00
106,512,14569.93,232945.90,203803.04,0.00,29142.86,37.56,0.00,0.00
107,512,14506.05,232164.77,203155.68,0.00,29009.09,37.56,0.00,0.00
108,512,14638.88,234184.09,204908.33,0.00,29275.76,38.25,0.00,0.00
109,512,14549.37,232761.96,203663.22,0.00,29098.75,37.56,0.00,0.00
110,512,14576.88,233140.04,203988.28,0.00,29151.76,38.25,0.00,0.00
111,512,15148.63,242572.13,212273.86,0.00,30298.27,73.13,0.00,0.00
112,512,14498.22,232026.51,203028.07,0.00,28998.44,39.65,0.00,0.00
113,512,14564.43,232829.85,203701.00,0.00,29128.86,39.65,0.00,0.00
114,512,14527.50,232487.95,203430.96,0.00,29056.99,39.65,0.00,0.00
115,512,15097.45,241451.13,211255.24,0.00,30195.89,41.10,0.00,0.00
116,512,14561.79,233156.65,204034.07,0.00,29122.58,38.25,0.00,0.00
117,512,14520.68,232205.82,203170.47,0.00,29035.35,38.25,0.00,0.00
118,512,14548.71,232928.31,203823.89,0.00,29104.41,38.94,0.00,0.00
119,512,14550.83,232796.30,203697.64,0.00,29098.66,38.25,0.00,0.00
120,512,14530.49,232290.81,203227.83,0.00,29062.97,38.25,0.00,0.00
121,512,14539.25,232694.00,203615.50,0.00,29078.50,38.25,0.00,0.00
122,512,14572.78,233259.41,204112.86,0.00,29146.55,38.25,0.00,0.00
123,512,14551.37,232638.83,203537.09,0.00,29101.74,38.25,0.00,0.00
124,512,14576.68,233444.88,204290.52,0.00,29154.36,38.25,0.00,0.00
125,512,14604.17,233539.80,204335.45,0.00,29204.35,38.25,0.00,0.00
126,512,14570.37,233146.90,204001.17,0.00,29145.74,38.25,0.00,0.00
127,512,14562.66,232986.54,203870.22,0.00,29116.32,38.25,0.00,0.00
128,512,14558.87,232893.84,203776.11,0.00,29117.73,38.25,0.00,0.00
129,512,14526.96,232498.41,203440.48,0.00,29057.93,38.25,0.00,0.00
130,512,14509.77,232174.36,203154.81,0.00,29019.54,38.25,0.00,0.00
131,512,14778.17,236425.73,206862.39,0.00,29563.34,61.08,0.00,0.00
132,512,14590.35,233479.56,204302.87,0.00,29176.69,38.94,0.00,0.00
133,512,14502.24,232167.90,203162.41,0.00,29005.49,38.94,0.00,0.00
134,512,14488.43,231737.80,202762.95,0.00,28974.85,38.94,0.00,0.00
135,512,15252.37,244040.88,213535.14,0.00,30505.73,75.82,0.00,0.00
136,512,14601.15,233511.32,204308.03,0.00,29203.29,41.10,0.00,0.00
137,512,14528.70,232594.15,203537.76,0.00,29056.39,39.65,0.00,0.00
138,512,14543.25,232651.04,203563.54,0.00,29087.50,40.37,0.00,0.00
139,512,14587.88,233393.10,204215.33,0.00,29177.76,39.65,0.00,0.00
140,512,14573.00,233152.06,204009.05,0.00,29143.01,38.25,0.00,0.00
141,512,14583.17,233213.80,204049.45,0.00,29164.35,38.25,0.00,0.00
142,512,14624.19,234125.03,204879.66,0.00,29245.37,38.25,0.00,0.00
143,512,14562.00,232896.02,203766.02,0.00,29130.00,38.25,0.00,0.00
144,512,14502.20,232103.16,203100.76,0.00,29002.39,38.25,0.00,0.00
145,512,14594.64,233438.29,204245.01,0.00,29193.29,38.25,0.00,0.00
146,512,14561.42,232976.71,203862.87,0.00,29113.84,38.25,0.00,0.00
147,512,14501.26,232153.27,203148.74,0.00,29004.53,38.25,0.00,0.00
148,512,14656.88,234338.07,205032.31,0.00,29305.76,38.94,0.00,0.00
149,512,14522.72,232488.49,203439.05,0.00,29049.44,38.25,0.00,0.00
150,512,14510.21,232148.35,203122.93,0.00,29025.42,37.56,0.00,0.00
151,512,14973.92,239575.64,209623.81,0.00,29951.83,38.94,0.00,0.00
152,512,14538.42,232669.74,203588.90,0.00,29080.84,37.56,0.00,0.00
153,512,14540.05,232629.80,203561.70,0.00,29068.10,37.56,0.00,0.00
154,512,14533.50,232474.00,203408.00,0.00,29066.00,37.56,0.00,0.00
155,512,14527.30,232570.86,203509.25,0.00,29061.61,37.56,0.00,0.00
156,512,14513.46,232156.32,203129.40,0.00,29026.91,37.56,0.00,0.00
157,512,15205.14,243243.28,212837.00,0.00,30406.29,39.65,0.00,0.00
158,512,14628.95,234078.25,204820.35,0.00,29257.91,38.94,0.00,0.00
159,512,14569.73,233068.66,203925.20,0.00,29143.46,38.25,0.00,0.00
160,512,14533.93,232647.85,203581.99,0.00,29065.86,38.25,0.00,0.00
161,512,15101.95,241702.14,211500.25,0.00,30201.89,39.65,0.00,0.00
162,512,14590.33,233146.26,203960.60,0.00,29185.65,38.25,0.00,0.00
163,512,14588.44,233469.01,204301.13,0.00,29167.88,38.25,0.00,0.00
164,512,14619.35,233938.54,204696.85,0.00,29241.69,37.56,0.00,0.00
165,512,14502.15,232211.43,203200.12,0.00,29011.30,38.25,0.00,0.00
166,512,14535.12,232489.90,203416.67,0.00,29073.23,38.25,0.00,0.00
167,512,14557.71,232858.39,203748.97,0.00,29109.42,38.25,0.00,0.00
168,512,14574.13,233266.07,204113.81,0.00,29152.26,38.25,0.00,0.00
169,512,14628.99,233966.84,204710.86,0.00,29255.98,38.25,0.00,0.00
170,512,14579.68,233375.95,204220.58,0.00,29155.37,38.25,0.00,0.00
171,512,14510.71,232119.41,203100.99,0.00,29018.43,38.25,0.00,0.00
172,512,14547.60,232916.53,203816.34,0.00,29100.19,38.25,0.00,0.00
173,512,14625.83,233944.26,204689.60,0.00,29254.66,38.25,0.00,0.00
174,512,14539.20,232516.22,203438.82,0.00,29077.40,38.25,0.00,0.00
175,512,15153.70,242515.27,212207.86,0.00,30307.41,45.79,0.00,0.00
176,512,14526.05,232532.83,203482.72,0.00,29050.11,38.25,0.00,0.00
177,512,14542.36,232635.82,203551.09,0.00,29084.73,38.25,0.00,0.00
178,512,14547.00,232487.01,203390.01,0.00,29097.00,38.25,0.00,0.00
179,512,14550.36,233046.78,203944.06,0.00,29102.72,38.25,0.00,0.00
180,512,14583.86,233302.78,204137.06,0.00,29165.72,38.25,0.00,0.00
181,512,14531.50,232476.93,203420.94,0.00,29055.99,38.25,0.00,0.00
182,512,14513.91,232138.58,203108.76,0.00,29029.82,38.25,0.00,0.00
183,512,14559.58,232930.24,203813.09,0.00,29117.16,38.25,0.00,0.00
184,512,14567.26,233183.12,204047.60,0.00,29135.51,38.25,0.00,0.00
185,512,14526.27,232472.30,203414.76,0.00,29057.54,38.25,0.00,0.00
186,512,14533.98,232587.69,203518.73,0.00,29068.96,38.25,0.00,0.00
187,512,14612.05,233585.74,204367.65,0.00,29218.09,38.25,0.00,0.00
188,512,14540.95,232819.30,203731.39,0.00,29087.91,38.25,0.00,0.00
189,512,14561.91,233016.60,203888.77,0.00,29127.82,38.25,0.00,0.00
190,512,14538.58,232499.27,203429.11,0.00,29070.16,37.56,0.00,0.00
191,512,15582.36,249237.69,218080.98,0.00,31156.71,95.81,0.00,0.00
192,512,14541.04,232754.61,203663.53,0.00,29091.08,41.10,0.00,0.00
193,512,14508.87,232136.86,203119.13,0.00,29017.73,39.65,0.00,0.00
194,512,14578.65,233245.44,204084.13,0.00,29161.30,38.94,0.00,0.00
195,512,14570.84,233062.42,203932.75,0.00,29129.68,38.94,0.00,0.00
196,512,14519.67,232533.65,203483.32,0.00,29050.33,38.25,0.00,0.00
197,512,14592.69,233337.03,204151.65,0.00,29185.38,38.25,0.00,0.00
198,512,14617.84,233871.45,204638.77,0.00,29232.68,38.25,0.00,0.00
199,512,15137.56,242226.01,211946.88,0.00,30279.13,41.10,0.00,0.00
200,512,14620.66,233929.59,204688.26,0.00,29241.32,38.25,0.00,0.00
201,512,14635.51,234020.20,204755.18,0.00,29265.03,38.25,0.00,0.00
202,512,14521.52,232460.32,203411.28,0.00,29049.04,38.25,0.00,0.00
203,512,14587.46,233441.37,204268.45,0.00,29172.92,38.25,0.00,0.00
204,512,14505.90,232125.35,203112.55,0.00,29012.79,38.25,0.00,0.00
205,512,14505.88,232114.02,203106.26,0.00,29007.75,38.25,0.00,0.00
206,512,14558.28,232767.52,203652.95,0.00,29114.57,38.25,0.00,0.00
207,512,14544.45,232840.16,203754.26,0.00,29085.90,38.25,0.00,0.00
208,512,14575.83,233232.35,204070.68,0.00,29161.67,38.25,0.00,0.00
209,512,14539.05,232605.76,203527.66,0.00,29078.09,38.25,0.00,0.00
210,512,14579.78,233029.51,203872.95,0.00,29156.56,38.25,0.00,0.00
211,512,14507.31,232153.89,203138.28,0.00,29015.61,37.56,0.00,0.00
212,512,14503.10,232119.67,203118.46,0.00,29001.21,37.56,0.00,0.00
213,512,14492.54,232063.58,203071.51,0.00,28992.07,37.56,0.00,0.00
214,512,14516.89,232320.27,203288.48,0.00,29031.78,37.56,0.00,0.00
215,512,14580.05,233206.83,204043.72,0.00,29163.10,38.25,0.00,0.00
216,512,14611.22,233730.48,204509.05,0.00,29221.43,38.25,0.00,0.00
217,512,14665.49,234676.81,205346.83,0.00,29329.97,38.25,0.00,0.00
218,512,14558.85,232852.69,203738.98,0.00,29113.71,38.25,0.00,0.00
219,512,14527.61,232698.82,203638.59,0.00,29060.22,38.25,0.00,0.00
220,512,14506.59,231992.51,202989.32,0.00,29003.19,38.25,0.00,0.00
221,512,14495.58,232029.36,203031.19,0.00,28998.17,38.25,0.00,0.00
222,512,14517.46,232034.27,202998.36,0.00,29035.91,38.25,0.00,0.00
223,512,14502.52,231998.32,202998.28,0.00,29000.04,38.25,0.00,0.00
224,512,14535.60,232815.60,203738.40,0.00,29077.20,38.25,0.00,0.00
225,512,14585.11,233224.79,204060.56,0.00,29164.22,38.25,0.00,0.00
226,512,14497.17,232042.79,203049.44,0.00,28993.35,38.25,0.00,0.00
227,512,14536.90,232531.37,203448.57,0.00,29082.79,38.25,0.00,0.00
228,512,14511.64,232018.15,202996.87,0.00,29021.27,38.25,0.00,0.00
229,512,14583.96,233233.33,204071.41,0.00,29161.92,38.25,0.00,0.00
230,512,14584.02,233707.24,204537.20,0.00,29170.03,38.25,0.00,0.00
231,512,14515.14,232115.28,203086.99,0.00,29028.28,38.25,0.00,0.00
232,512,14570.92,233148.66,204005.83,0.00,29142.83,38.25,0.00,0.00
233,512,14602.26,233774.23,204567.70,0.00,29206.53,38.25,0.00,0.00
234,512,14519.90,232065.34,203027.55,0.00,29037.79,38.25,0.00,0.00
235,512,14520.32,232572.17,203531.53,0.00,29040.65,38.25,0.00,0.00
236,512,14530.41,232310.60,203247.78,0.00,29062.82,38.25,0.00,0.00
237,512,14503.21,232053.29,203043.88,0.00,29009.41,38.25,0.00,0.00
238,512,14507.81,232138.98,203125.36,0.00,29013.62,38.25,0.00,0.00
239,512,14547.48,232898.66,203802.71,0.00,29095.96,38.25,0.00,0.00
240,512,14513.26,232087.17,203059.65,0.00,29027.52,38.25,0.00,0.00
241,512,14501.57,231994.13,202990.99,0.00,29003.14,38.25,0.00,0.00
242,512,14542.98,232527.75,203446.78,0.00,29080.97,38.25,0.00,0.00
243,512,14496.55,232118.87,203123.76,0.00,28995.11,38.25,0.00,0.00
244,512,14569.19,233157.06,204020.68,0.00,29136.38,38.25,0.00,0.00
245,512,14536.30,232470.79,203396.19,0.00,29074.60,38.25,0.00,0.00
246,512,14501.51,232207.12,203204.11,0.00,29003.02,38.25,0.00,0.00
247,512,14526.27,232252.29,203207.75,0.00,29044.53,38.25,0.00,0.00
248,512,14529.22,232510.51,203443.07,0.00,29067.44,38.25,0.00,0.00
249,512,14490.89,231905.25,202929.47,0.00,28975.78,38.25,0.00,0.00
250,512,14487.35,231919.64,202933.94,0.00,28985.71,38.25,0.00,0.00
251,512,15153.76,242397.09,212095.58,0.00,30301.51,46.63,0.00,0.00
252,512,14551.98,232695.66,203596.70,0.00,29098.96,38.25,0.00,0.00
253,512,14520.68,232444.93,203398.56,0.00,29046.37,38.25,0.00,0.00
254,512,14520.83,232220.24,203178.59,0.00,29041.65,38.25,0.00,0.00
255,512,14530.67,232515.70,203457.36,0.00,29058.34,38.25,0.00,0.00
256,512,14572.58,233223.36,204072.19,0.00,29151.17,38.25,0.00,0.00
257,512,14531.01,232491.15,203433.13,0.00,29058.02,38.25,0.00,0.00
258,512,14534.42,232428.65,203363.82,0.00,29064.83,38.25,0.00,0.00
259,512,14549.72,232946.53,203842.09,0.00,29104.44,38.25,0.00,0.00
260,512,14530.67,232530.66,203473.33,0.00,29057.34,37.56,0.00,0.00
261,512,14514.96,232042.34,203009.41,0.00,29032.92,37.56,0.00,0.00
262,512,14580.58,233303.28,204143.12,0.00,29160.16,37.56,0.00,0.00
263,512,14492.37,231990.92,202998.18,0.00,28992.74,37.56,0.00,0.00
264,512,14537.49,232500.83,203427.85,0.00,29072.98,38.25,0.00,0.00
265,512,15135.85,242231.56,211958.87,0.00,30272.70,54.83,0.00,0.00
266,512,14582.33,233265.29,204106.63,0.00,29158.66,38.25,0.00,0.00
267,512,14539.40,232727.38,203650.59,0.00,29076.80,38.25,0.00,0.00
268,512,14567.47,233075.56,203939.62,0.00,29135.95,38.25,0.00,0.00
269,512,14548.64,232826.16,203719.89,0.00,29106.27,38.25,0.00,0.00
270,512,14546.96,232656.26,203568.35,0.00,29087.91,38.25,0.00,0.00
271,512,15606.34,249715.43,218503.76,0.00,31211.68,108.68,0.00,0.00
272,512,14591.28,233466.46,204286.90,0.00,29179.56,38.25,0.00,0.00
273,512,14592.97,233527.51,204334.57,0.00,29192.94,38.25,0.00,0.00
274,512,14525.26,232272.11,203224.59,0.00,29047.52,38.25,0.00,0.00
275,512,14531.95,232628.15,203560.26,0.00,29067.89,38.25,0.00,0.00
276,512,14507.51,232119.24,203111.21,0.00,29008.03,38.25,0.00,0.00
277,512,14558.22,233055.52,203939.09,0.00,29116.44,38.25,0.00,0.00
278,512,14619.93,233897.91,204652.05,0.00,29245.86,38.25,0.00,0.00
279,512,14579.62,233092.99,203934.74,0.00,29158.25,38.25,0.00,0.00
280,512,14537.46,232720.37,203645.45,0.00,29074.92,38.25,0.00,0.00
281,512,14564.68,233083.90,203956.54,0.00,29127.36,38.25,0.00,0.00
282,512,14581.75,233250.02,204091.51,0.00,29158.50,38.25,0.00,0.00
283,512,15122.61,241664.77,211419.55,0.00,30245.22,38.94,0.00,0.00
284,512,14864.79,238125.71,208389.12,0.00,29736.59,38.94,0.00,0.00
285,512,14555.93,232727.90,203626.04,0.00,29101.86,38.25,0.00,0.00
286,512,14586.87,233393.88,204215.14,0.00,29178.73,38.25,0.00,0.00
287,512,14544.30,232779.79,203693.19,0.00,29086.60,38.25,0.00,0.00
288,512,14511.58,232304.21,203275.06,0.00,29029.15,38.25,0.00,0.00
289,512,14508.30,232118.86,203101.25,0.00,29017.61,38.25,0.00,0.00
290,512,14579.57,233099.10,203947.96,0.00,29151.14,38.25,0.00,0.00
291,512,14529.37,232621.85,203555.12,0.00,29066.73,38.25,0.00,0.00
292,512,14561.60,232874.57,203753.38,0.00,29121.20,38.25,0.00,0.00
293,512,14527.08,232386.25,203338.09,0.00,29048.16,38.25,0.00,0.00
294,512,14533.45,232605.12,203532.23,0.00,29072.89,38.25,0.00,0.00
295,512,14508.43,232155.90,203138.04,0.00,29017.86,38.25,0.00,0.00
296,512,14525.46,232505.39,203457.46,0.00,29047.92,38.25,0.00,0.00
297,512,14516.75,232383.99,203347.49,0.00,29036.50,38.25,0.00,0.00
298,512,14534.60,232435.63,203366.43,0.00,29069.20,38.25,0.00,0.00
299,512,14547.20,232724.22,203625.81,0.00,29098.40,38.25,0.00,0.00
300,512,14423.77,230213.02,201491.10,0.00,28721.92,38.25,0.00,0.00
SQL statistics:
    queries performed:
        read:                            61241852
        write:                           0
        other:                           8748836
        total:                           69990688
    transactions:                        4374418 (14576.44 per sec.)
    queries:                             69990688 (233223.05 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.1005s
    total number of events:              4374418

Latency (ms):
         min:                                    1.47
         avg:                                   35.11
         max:                                  671.27
         95th percentile:                       38.25
         sum:                            153602938.48

Threads fairness:
    events (avg/stddev):           8543.7852/124.16
    execution time (avg/stddev):   300.0057/0.03